# ()                     Innermost First , L => R
# -,+,--,++,sizeof,type  เพิ่มหรือลดค่าตัวเเปร R => L
# *, /, %                L => R
# +, -                   L => R
# =                      R => L

# Ex1
x1 = 5+2*10
# first 2*10 = 20
# x1 = 5+20
# x1 = 25
print("x1 = ", x1)

#-------------------

# Ex2
x2 = (5+2)*10/2
# first (5+2) = 7
# x2 = 7*10/2        ---->  *, /, %  L => R
# ดังนั้นทำ 7*10 ซึ่งอยู่ทางด้านซ้ายก่อน
# x2 = 70/25
# x2 = 35
print("x2 = ", x2)

#------------------------------------------------

# Ex3
x3 = 5+2/10*2-5
# first 2/10 ทำซึ่งอยู่ทางด้านซ้ายก่อน
# x3 = 5+0.2*2-5
# ทำคูณก่อน 0.2*2 = 0.4
# x3 = 5+0.4-5
# ทำ +,- ไล่จาก L => R
# 5+0.4 = 5.4
# 5.4-5 = 0.4
print("x3 = ", x3)