'''
List  = []   เก็บข้อมูลต่างชนิดกันได้ , เเก้ไขข้อมูลได้ , ข้อมูลซ้ำกันได้ , ซ้ายไปขวา

Tuple = ()   เก็บข้อมูลต่างชนิดกันได้ , เเก้ไขข้อมูลไม่ได้(ต้องเเปลงเป็น list ก่อน) , ข้อมูลซ้ำกันได้ , ซ้ายไปขวา

Set   = {}   เก็บข้อมูลต่างชนิดกันได้ , เเก้ไขข้อมูลไม่ได้(ไม่มี index ในการเข้าถึง) , ข้อมูลซ้ำกันไม่ได้ , ลำดับไม่เเน่นอน
'''

# สร้าง set เเบบ ปกติ

# first
set1 = {"มะขาม", "มะม่วง"} # บางทีก็ print (มะขาม มะม่วง) เเต่บางที่ print (มะม่วง มะขาม) => ลำดับไม่เเน่นอน

print("type of set1 = ", type(set1))
print("set1 = ", set1)

print("\n")

# second
set2 = {"bird", "ant", "cat", "xylophone"} # printออกมา ลำดับไม่เเน่นอน
print("type of set2 = ", type(set2))
print("set2 = ", set2)

print("\n")

# third
# สร้าง list เเบบ constructor
fish = set(["salmon", "tuna", "shark"])
print("fish = ", fish)

print("\n")

# ถ้ามีข้อมูลซ้ำจะเเสดงเเค่ตัวเดียว โดย ตัดสมาชิกตัวเเรกที่เจอออก (print ออกมา ลำดับไม่เเน่นอนเหมือนเดิม)
gun = set(["Aka47", "M16", "Bazuka", "M16"])
print("gun = ", gun)