# ตัวดำเนินการ        Operator
# ตัว "ถูก" ดำเนินการ  Operand

# A + B
# A, B is Operand
# +    is Operator

x = 11
y = 10
z = 9
print("ผลบวก", x+y)
print("ผลลบ", x-y)
print("ผลคูณ", x*y)
print("ผลหาร", x/y)
print("ผลหารปัดเศษ", x//y)  # ปัดลงเสมอ
print("ยกกำลัง", x**y)       
print("หารเพื่อเอาเศษ", x%y)  # 10/4 เหลือเศษ 2 เพราะฉนั้น 10 % 4 == 2

# Compare Operator
# ถ้านำข้อมูล "อย่างน้อย 2 ค่า" มาเปรียบเทียบกันต้องมี "ชนิดของข้อมูล" เหมือนกัน
# ผลจะออกมาเป็น True หรือ False
print(x>y)
print("ค่า x น้อยกว่า ค่า y หรือไม่ : ", x<y)
print("ค่า x เท่ากับ ค่า y หรือไม่ : ", x==y)
print("ค่า x ไม่เท่ากับ ค่า y หรือไม่ : ", x!=y)
print("ค่า x มากกว่าหรือเท่ากับ ค่า y หรือไม่ : ", x>=y)
print("ค่า x น้อยกว่าหรือเท่ากับ ค่า y หรือไม่ : ", x<=y)

# and => มี case ใด case หนึ่งเป็นเท็จ จะ return false กลับมาทันที
print("ค่า x มากกว่า y เเละ ค่า y มากกว่า z หรือไม่ : ", x>y>z)
print("ค่า x น้อยกว่า y เเละ ค่า y น้อยกว่า z หรือไม่ : ", x<y<z)